// Алгоритм for_each c++ | Библиотека стандартных шаблонов (stl) C++ #22 - Видео 22.

#include<iostream>
#include<algorithm>

using namespace std;


//---------------------------------------------------------------------------------------
void Foo(int a)
{
	cout << a << endl;
}
//---------------------------------------------------------------------------------------
int main()
{
	setlocale(LC_ALL,"ru");

	//------------------------------------------------------------------------------------
	
	cout << "Пример с функцией." << endl;

	int arr[] = {1,2,10,55};

	for_each(begin(arr), end(arr), Foo);

	cout << "Пример с циклом.(тотже for_each с другим синтексом написания.)" << endl;

	for (auto a : arr)
	{
		Foo(a);
	}

	//------------------------------------------------------------------------------------

	cout << "Пример с анонимной лямдой выражений." << endl;

	int arr2[] = {3,8,14,55};

	for_each(begin(arr2), end(arr2), [](int a)
	{
		cout << a << endl;
	});

	cout << "Аналог записи for_each" << endl;

	for (auto a : arr2)
	{
		cout << a << endl;
	}

	//------------------------------------------------------------------------------------

	cout << "Пример получения имзминённого массива." << endl;

	int arr3[] = {9,7,11,55};

	for_each(begin(arr3), end(arr3), [](int &a)
	{
		cout << a << endl;
		a++;
	});

	cout << "Аналог записи for_each" << endl;

	for (auto &a : arr3)
	{
		cout << a << endl;
		a++;
	}

	/*Для получения изминённого массива, обращаемся по ссылке, тоесть - &a,
	  иначе получим массив с изначальными данными без изминений.*/

	return 0;
}
//---------------------------------------------------------------------------------------

/*Разницы между for_each и for (auto &a : arr3) никакой, кроме синтекса написания.*/